app/views/dash/view.html.erb

SELECT "names".* FROM "names"  WHERE "names"."user_id" = ?  [["user_id", 1]]
---
<% @names.each do |f| %>
<% @client.user_timeline(f.name).take(5).each do |g| %>