app/controllers/dash_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
SELECT "names".* FROM "names"  WHERE "names"."user_id" = ?  [["user_id", 1]]
---
  def view
   @client = Twitter::REST::Client.new do |config|
     config.consumer_key        = "i9uQC4pd5zvhO1XuuVweuAUXl"
     config.consumer_secret     = "tYpV4Eg4EXcFJmTVraFEqEQm0hNkAgzXA70HJvSMZjfvtElanV"
     config.access_token        = "2895338556-OQjfqvq7stJpgQmAY06Sy5iT1cSZXiT3QP9LbUo"
     config.access_token_secret = "n8HRDu7qsUZthqApCZdEp3pQlAaVbPizByIXB1zYhvzHD"
   end
   @names = User.find(session[:user_id]).names