app/controllers/names_controller.rb

INSERT INTO "names" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-19 07:27:38.023493"], ["name", "iamsrk"], ["updated_at", "2014-11-19 07:27:38.023493"], ["user_id", 1]]
---
  def create
    @name = Name.new(name_params)

    respond_to do |format|
      @name.user_id = session[:user_id]
      if @name.save